bench/rheotool/poiseuille_ve_wi0.5/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rheoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         40000;

deltaT          0.5;

writeControl    runTime;

writeInterval   5000;

purgeWrite      4;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   10;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.4;

maxDeltaT       50;

functions
{
    probes
    {
        functionObjectLibs ( "libsampling.so" );
        type            probes;
        name            probes;
        writeControl    timeStep;
        writeInterval   200;
        fields          ( U tau );
        probeLocations  ( ( 4 8 0 ) );
    }
}


// ************************************************************************* //
