bench/rheotool/poiseuille_ve_wi0.5/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|    \\/     M anipulation  | Version:  9                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
    linExtrapGrad   Gauss linear;
}

divSchemes
{
    default                  none;
    div(tau)                 Gauss linear;
    div(grad(U))             Gauss linear;
    div(phi,U)               GaussDefCmpw none;
    div(phi,theta)           GaussDefCmpw cubista;
    div(phi,tau)             GaussDefCmpw cubista;
    div(phi,C)               GaussDefCmpw cubista;
}

laplacianSchemes
{
    default                       none;
    laplacian(eta,U)              Gauss linear corrected;
    laplacian(p|(ap-H1))          Gauss linear corrected;
    laplacian(D,C)                Gauss linear corrected;
}

interpolationSchemes
{
    default           linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
