bench/rheotool/poiseuille_ve_wi0.5/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|    \\/     M anipulation  | Version:  9                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");

setFormat raw;

surfaceFormat raw;

interpolationScheme cellPoint;

fields
(
   U
   tau
);

sets
(
    lineVert
    {
        type        lineCell;     // one sample per cell crossed -> cell centres
        axis        y;
        start       ( 4 -16 0 );
        end         ( 4  16 0 );
    }
);

surfaces
(
);

// ************************************************************************* //
