bench/rheotool/poiseuille_ve_wi0.5/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication checkMesh

runApplication $application

runApplication postProcess -func sampleDict -latestTime
